{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "l_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 1], "dtype": "float32", "sparse": false, "name": "l_input"}, "inbound_nodes": []}, {"name": "l_flatten", "class_name": "Flatten", "config": {"name": "l_flatten", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["l_input", 0, 0, {}]]]}, {"name": "attention_vec", "class_name": "Dense", "config": {"name": "attention_vec", "trainable": true, "units": 26, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["l_flatten", 0, 0, {}]]]}, {"name": "attention_mul", "class_name": "Multiply", "config": {"name": "attention_mul", "trainable": true}, "inbound_nodes": [[["l_flatten", 0, 0, {}], ["attention_vec", 0, 0, {}]]]}, {"name": "dense_385", "class_name": "Dense", "config": {"name": "dense_385", "trainable": true, "batch_input_shape": [null, 26], "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["attention_mul", 0, 0, {}]]]}, {"name": "dropout_103", "class_name": "Dropout", "config": {"name": "dropout_103", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_385", 0, 0, {}]]]}, {"name": "dense_386", "class_name": "Dense", "config": {"name": "dense_386", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_103", 0, 0, {}]]]}, {"name": "dropout_104", "class_name": "Dropout", "config": {"name": "dropout_104", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_386", 0, 0, {}]]]}, {"name": "dense_387", "class_name": "Dense", "config": {"name": "dense_387", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_104", 0, 0, {}]]]}], "input_layers": [["l_input", 0, 0]], "output_layers": [["dense_387", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}